app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
    def index
        render(json: { tweets: Tweet.all })

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      def show
        # Input comes in from the `params` hash
        render(json: Tweet.find(params[:id]))

INSERT INTO "tweets" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-11-21 23:27:27.418800"], ["updated_at", "2020-11-21 23:27:27.418800"]]
---
      def create
        tweet = Tweet.new(tweet_params)

        if tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def update
        tweet = Tweet.find(params[:id])

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def get_tweet
          @tweet = Tweet.find(params[:id])